html/portfolio-versus-resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Portfolio versus resume</title>
<meta name="author" content="dirtysalt" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content" class="content">
<h1 class="title">Portfolio versus resume</h1>
<p>
<a href="https://matt.might.net/articles/what-cs-majors-should-know/">
What every computer science major should know</a>
</p>

<p>
这个主题是上面这篇文章的一个部分，是portfolio重要还是resume重要，这个毫无疑问是前者。令我吃惊的是，作者说resume几乎没有办法证明程序员的能力，如果作者是这么认为的话，那么有可能其他人也会是这么认为的。这种观点不是科学观点而是社会观点，所以我觉得influencer的观点可以基本认为是正确的。
</p>

<p>
很早之前看过这篇文章，主要是关注里面和技术相关的内容。最近重新翻出这篇文章，关注的点不同，感觉又学习到不同的东西。
</p>


<blockquote>
<p>
[!NOTE]
Having emerged from engineering and mathematics, computer science programs take a resume-based approach to hiring off their graduates.
</p>

<p>
A <b><b>resume</b></b> says nothing of a programmer's ability.
</p>

<p>
Every computer science major should build a <b><b>portfolio</b></b>.
</p>

<p>
A portfolio could be as simple as a personal blog, with a post for each project or accomplishment. A better portfolio would include per-project pages, and publicly browsable code (hosted perhaps on github or Google code).
</p>

<p>
Contributions to open source should be linked and documented.
</p>

<p>
A code portfolio allows employers to directly judge ability.
</p>

<p>
GPAs and resumes do not.
</p>

<p>
Professors should design course projects to impress on portfolios, and students, at the conclusion of each course, should take time to update them.
</p>

<p>
Examples
</p>
<ul class="org-ul">
<li><a href="http://ezyang.com/">Edward Yang's web site</a>.</li>
<li><a href="http://www.mjbshaw.com/">Michael Bradshaw's web site</a>.</li>
<li><a href="http://pydanny.blogspot.com/2011/08/github-is-my-resume.html">Github is my resume</a>.</li>
</ul>
</blockquote>
</div>
</body>
</html>
